Repository: teelur/budget-board
Catalog: server/BudgetBoard.WebAPI/Resources/ApiResponseStrings.*.resx
Languages: de, zh_hans

# UnexpectedServerError
source: An unexpected error occurred.
de: Ein unerwarteter Fehler ist aufgetreten.
zh_hans: 发生意外错误。

# AuthCodeRequired
source: The authorization code is required.
de: Der Authorisierungsschlüssel wird benötigt.
zh_hans: 需要授权码。

# AuthFailed
source: Authentication failed.
de: Authentifizierung fehlgeschlagen.
zh_hans: 身份验证失败。

# LoginFailed
source: Unable to complete login.
de: Anmeldung konnte nicht abgeschlossen werden.
zh_hans: 无法完成登录。

# UserNotAuthenticated
source: The user is not authenticated.
de: Der Benutzer ist nicht authentifiziert.
zh_hans: 用户未通过身份验证。

# UserNotFound
source: The user was not found.
de: Der Benutzer wurde nicht gefunden.
zh_hans: 未找到该用户。

# NoOidcLoginFound
source: No OIDC login was found for this user.
de: Für diesen Benutzer wurde keine OIDC-Anmeldung gefunden.
zh_hans: 未找到此用户的 OIDC 登录信息。

# RemoveOidcNoPassword
source: Cannot remove OIDC login. The user must have a local password set first to maintain account access.
de: Die OIDC-Anmeldung kann nicht entfernt werden. Der Benutzer muss zunächst ein lokales Passwort festlegen, um den Zugriff auf das Konto aufrechtzuerhalten.
zh_hans: 无法移除 OIDC 登录。用户必须先设置本地密码以保持账户访问权限。

# RemoveOidcFailed
source: Failed to remove OIDC login.
de: Konnte die OIDC-Anmeldung nicht entfernen.
zh_hans: 移除 OIDC 登录失败。

# RemoveOidcSuccess
source: OIDC login disconnected successfully.
de: OIDC-Anmeldung erfolgreich getrennt.
zh_hans: OIDC 登录已成功断开连接。

# UserIdNotFound
source: The user ID was not found.
de: Die Benutzer-ID wurde nicht gefunden.
zh_hans: 未找到用户 ID。

# InvalidJsonType
source: The provided JSON token type is invalid.
de: Der angegebene JSON-Token-Typ ist ungültig.
zh_hans: 提供的 JSON 令牌类型无效。

# LocalAccountProviderName
source: Local Account
de: Lokales Konto
zh_hans: 本地账户

# RegistrationDisabledError
source: Registration is disabled.
de: Registrierung ist deaktiviert.
zh_hans: 注册已禁用。

# NoEmailConfirmationEndpointError
source: No email confirmation endpoint was registered!
de: Es wurde kein E-Mail-Bestätigungsendpunkt registriert!
zh_hans: 未注册电子邮件确认端点！

# UserEmailRequiredError
source: The user must have an email address.
de: Der Benutzer muss über eine E-Mail-Adresse verfügen.
zh_hans: 用户必须拥有电子邮件地址。

# EndpointNotFoundError
source: Could not find the endpoint named '{0}'.
de: Der Endpunkt mit dem Namen '{0}' wurde nicht gefunden.
zh_hans: 未找到名为“{0}”的端点。
